; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p1-0 - location
	p1-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s0)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at package1 s0)
	(at package2 s0)
	(at package3 s0)
	(at package4 s0)
	(at package5 s0)
	(at package6 s2)
	(at package7 s2)
	(at package8 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 81)
	(= (time-to-walk p0-1 s0) 81)
	(= (time-to-walk s1 p0-1) 46)
	(= (time-to-walk p0-1 s1) 46)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 5)
	(= (time-to-walk p1-2 s1) 5)
	(= (time-to-walk s2 p1-2) 56)
	(= (time-to-walk p1-2 s2) 56)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 90)
	(= (time-to-drive s1 s0) 90)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 72)
	(= (time-to-drive s2 s0) 72)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 3)
	(= (time-to-drive s2 s1) 3)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s1)
	(at driver4 s1)
	(at truck1 s2)
	(at truck2 s2)
	(at truck3 s2)
	(at package1 s2)
	(at package2 s2)
	(at package3 s2)
	(at package4 s2)
	(at package5 s2)
	(at package7 s1)
	(at package8 s1)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 2  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 2 of 12
2. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 0 to 3
   goals met: 3 of 12
3. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   changed: (walked) from 0 to 81
   goals met: 3 of 12
4. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   changed: (walked) from 81 to 127
   goals met: 4 of 12
5. (walk driver4 s0 p0-1)
   deleted: (at driver4 s0)
   added: (at driver4 p0-1)
   changed: (walked) from 127 to 208
   goals met: 4 of 12
6. (walk driver4 p0-1 s1)
   deleted: (at driver4 p0-1)
   added: (at driver4 s1)
   changed: (walked) from 208 to 254
   goals met: 5 of 12
7. (load-truck package7 truck3 s2)
   deleted: (at package7 s2)
   added: (in package7 truck3)
   goals met: 5 of 12
8. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 3 to 6
   goals met: 4 of 12
9. (unload-truck package7 truck3 s1)
   deleted: (in package7 truck3)
   added: (at package7 s1)
   goals met: 5 of 12
10. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 6 to 96
   goals met: 5 of 12
11. (load-truck package1 truck3 s0)
   deleted: (at package1 s0)
   added: (in package1 truck3)
   goals met: 5 of 12
12. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   goals met: 5 of 12
13. (load-truck package3 truck3 s0)
   deleted: (at package3 s0)
   added: (in package3 truck3)
   goals met: 5 of 12
14. (load-truck package4 truck3 s0)
   deleted: (at package4 s0)
   added: (in package4 truck3)
   goals met: 5 of 12
15. (load-truck package5 truck3 s0)
   deleted: (at package5 s0)
   added: (in package5 truck3)
   goals met: 5 of 12
16. (load-truck package8 truck3 s0)
   deleted: (at package8 s0)
   added: (in package8 truck3)
   goals met: 5 of 12
17. (drive-truck truck3 s0 s2 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 96 to 168
   goals met: 6 of 12
18. (unload-truck package1 truck3 s2)
   deleted: (in package1 truck3)
   added: (at package1 s2)
   goals met: 7 of 12
19. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 8 of 12
20. (unload-truck package3 truck3 s2)
   deleted: (in package3 truck3)
   added: (at package3 s2)
   goals met: 9 of 12
21. (unload-truck package4 truck3 s2)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   goals met: 10 of 12
22. (unload-truck package5 truck3 s2)
   deleted: (in package5 truck3)
   added: (at package5 s2)
   goals met: 11 of 12
23. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 168 to 171
   goals met: 10 of 12
24. (unload-truck package8 truck3 s1)
   deleted: (in package8 truck3)
   added: (at package8 s1)
   goals met: 11 of 12
25. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 171 to 174
   goals met: 12 of 12
